In [2]:
from sqlalchemy import create_engine
import pandas as pd
from getpass import getpass

password = getpass()

def create_engine_connection(password):
    engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw=password,
                               db="sakila"))
    return engine

def rentals_month(engine, month, year):
    rental_query = f"""
    SELECT rental_id, customer_id, rental_date
    FROM rental
    WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}
    """
    return pd.read_sql_query(rental_query, con=engine)

def rental_count_month(rentals_df, month, year):
    rentals_count = rentals_df.groupby('customer_id').size().reset_index(name=f'rentals_{month:02d}_{year}')
    return rentals_count

def compare_rentals(df1, df2, month1, year1, month2, year2):
    combined_df = df1.merge(df2, on='customer_id', how='inner')
    combined_df['difference'] = combined_df[f'rentals_{month1:02d}_{year1}'] - combined_df[f'rentals_{month2:02d}_{year2}']
    return combined_df


engine = create_engine_connection(password)


rentals_may = rentals_month(engine, 5, 2005)
rentals_june = rentals_month(engine, 6, 2005)


rental_count_may = rental_count_month(rentals_may, 5, 2005)
rental_count_june = rental_count_month(rentals_june, 6, 2005)


comparison = compare_rentals(rental_count_may, rental_count_june, 5, 2005, 6, 2005)

C:\Users\erik\AppData\Local\Temp\ipykernel_52108\1731876098.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
rentals_may

      rental_id  customer_id         rental_date
0             1          130 2005-05-24 22:53:30
1             2          459 2005-05-24 22:54:33
2             3          408 2005-05-24 23:03:39
3             4          333 2005-05-24 23:04:41
4             5          222 2005-05-24 23:05:21
...         ...          ...                 ...
1151       1153          506 2005-05-31 21:36:44
1152       1154           59 2005-05-31 21:42:09
1153       1155          251 2005-05-31 22:17:11
1154       1156          106 2005-05-31 22:37:34
1155       1157           61 2005-05-31 22:47:45

[1156 rows x 3 columns]

In [4]:
rentals_june

      rental_id  customer_id         rental_date
0          1158          416 2005-06-14 22:53:33
1          1159          516 2005-06-14 22:55:13
2          1160          239 2005-06-14 23:00:34
3          1161          285 2005-06-14 23:07:08
4          1162          310 2005-06-14 23:09:38
...         ...          ...                 ...
2306       3465          510 2005-06-21 22:10:01
2307       3466          226 2005-06-21 22:13:33
2308       3467          543 2005-06-21 22:19:25
2309       3468          100 2005-06-21 22:43:45
2310       3469          181 2005-06-21 22:48:59

[2311 rows x 3 columns]

In [5]:
rental_count_may

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [6]:
rental_count_june

     customer_id  rentals_06_2005
0              1                7
1              2                1
2              3                4
3              4                6
4              5                5
..           ...              ...
585          595                2
586          596                2
587          597                3
588          598                1
589          599                4

[590 rows x 2 columns]

In [7]:
comparison

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1                2                7          -5
1              2                1                1           0
2              3                2                4          -2
3              5                3                5          -2
4              6                3                4          -1
..           ...              ...              ...         ...
507          594                4                6          -2
508          595                1                2          -1
509          596                6                2           4
510          597                2                3          -1
511          599                1                4          -3

[512 rows x 4 columns]